import DB from '../db.js';

//--------------------------------------------------
// 類別 : 元件(component) 
// 標籤 : skilltree
// 功能 :
//  角色的技能樹
//--------------------------------------------------

export class SkillTree
{
    constructor()
    {
        this._skTree = {}; // 技能樹資料
    }

    get tag() {return 'skilltree';}   // 回傳元件的標籤

    //------------------------------------------------------
    //  Local
    //------------------------------------------------------

    //------------------------------------------------------
    //  Public
    //------------------------------------------------------
    bind(root)
    {
        this._root = root;
        // 在上層綁定操作介面，提供給其他元件使用

        this._skTree = DB.skTree;

        //
        root.skTree = this._skTree;
        
        // 註冊 event
        

    }
}